; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	infrared4 - mode
	image3 - mode
	spectrograph1 - mode
	image0 - mode
	spectrograph5 - mode
	infrared2 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 spectrograph5)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared4)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 infrared4)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument8 image3)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite2 Star10)
	(pointing satellite3 Phenomenon9)
	(pointing satellite4 Star2)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 infrared4)
	(have_image Planet8 infrared4)
	(have_image Phenomenon9 image3)
	(have_image Star10 image3)
))

)

; plan
1. (turn_to satellite4 star2 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star2)
   goals met: 2 of 9
2. (turn_to satellite3 groundstation3 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 9
3. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 9
4. (calibrate satellite3 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 1 of 9
5. (turn_to satellite3 phenomenon6 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 9
6. (turn_to satellite2 star10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star10)
   goals met: 2 of 9
7. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 2 of 9
8. (take_image satellite3 phenomenon6 instrument6 image3)
   added: (have_image phenomenon6 image3)
   goals met: 3 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 9
11. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 9
12. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 4 of 9
13. (turn_to satellite0 planet8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet8)
   goals met: 4 of 9
14. (take_image satellite0 planet8 instrument0 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 5 of 9
15. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 5 of 9
16. (take_image satellite0 star7 instrument0 infrared4)
   added: (have_image star7 infrared4)
   goals met: 6 of 9
17. (turn_to satellite3 star10 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star10)
   goals met: 6 of 9
18. (take_image satellite3 star10 instrument6 image3)
   added: (have_image star10 image3)
   goals met: 7 of 9
19. (turn_to satellite3 phenomenon9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon9)
   goals met: 8 of 9
20. (take_image satellite3 phenomenon9 instrument6 image3)
   added: (have_image phenomenon9 image3)
   goals met: 9 of 9
